# Lista de Exercícios 5

In [40]:
import pandas as pd
import numpy as np

## Exercício 1

In [17]:
data = [
    [5, 7, 5, 6, 5, 5, 7, 5, 6, 6, 7, 5, 5, 6, 6],
    [1, 1, 2, 2, 2, 1, 2, 1, 1, 2, 2, 2, 2, 2, 2],
    [4, 4, 5, 6, 7, 7, 6, 5, 5, 6, 7, 7, 6, 6, 7]
]
index = ["C", "M", "A"]
columns = [i+1 for i in range(15)]
dt = pd.DataFrame(data, index = index, columns = columns)
dt

   1   2   3   4   5   6   7   8   9   10  11  12  13  14  15
C   5   7   5   6   5   5   7   5   6   6   7   5   5   6   6
M   1   1   2   2   2   1   2   1   1   2   2   2   2   2   2
A   4   4   5   6   7   7   6   5   5   6   7   7   6   6   7

### A)

In [30]:
data = {
    "n": dt.loc["C"].value_counts(),
    "f": dt.loc["C"].value_counts(normalize = True).round(2)
}
marg_C = pd.DataFrame(data)
marg_C.loc["Total"] = [sum(marg_C["n"]), 1]
marg_C

        n     f
5       7  0.47
6       5  0.33
7       3  0.20
Total  15  1.00

In [29]:
data = {
    "n": dt.loc["M"].value_counts(sort = False),
    "f": dt.loc["M"].value_counts(normalize = True).round(2)
}
marg_M = pd.DataFrame(data)
marg_M.loc["Total"] = [sum(marg_M["n"]), 1]
marg_M

        n     f
1       5  0.33
2      10  0.67
Total  15  1.00

In [28]:
data = {
    "n": dt.loc["A"].value_counts(sort = False),
    "f": dt.loc["A"].value_counts(normalize = True).round(2)
}
marg_A = pd.DataFrame(data)
marg_A.loc["Total"] = [sum(marg_A["n"]), 1]
marg_A

        n     f
4       2  0.13
5       3  0.20
6       5  0.33
7       5  0.33
Total  15  1.00

### B)

In [34]:
dt_CM = pd.crosstab(dt.loc["C"], dt.loc["M"])
dt_CM

M  1  2
C
5  3  4
6  1  4
7  1  2

In [36]:
dt_CA = pd.crosstab(dt.loc["C"], dt.loc["A"])
dt_CA

A  4  5  6  7
C
5  1  2  1  3
6  0  1  3  1
7  1  0  1  1

In [38]:
dt_MA = pd.crosstab(dt.loc["M"], dt.loc["A"])
dt_MA

A  4  5  6  7
M
1  2  2  0  1
2  0  1  5  4

### D)

In [43]:
media_M = np.mean(dt.loc["M"])
media_M

1.6666666666666667

In [45]:
media_A = np.mean(dt.loc["A"])
media_A

5.866666666666666

## Exercício 2

In [50]:
data = [
    [110, 235, 120, 465],
    [51, 122, 178, 351],
    [15, 84, 162, 261],
    [176, 441, 460, 1077]
]
columns = [0, 1, 2, "Total"]
index = [0, 1, 2, "Total"]
dt = pd.DataFrame(data, index = index, columns = columns)
dt.columns.name = "T"
dt.index.name = "A"
dt

T        0    1    2  Total
A
0      110  235  120    465
1       51  122  178    351
2       15   84  162    261
Total  176  441  460   1077

### A)

In [58]:
data = {
    "n": [465, 351, 261, 1077]
}
index = [0, 1, 2, "Total"]
marg_A = pd.DataFrame(data, index = index)
marg_A.index.name = "A"
marg_A

          n
A
0       465
1       351
2       261
Total  1077

In [63]:
data = {
    "n": [176, 441, 460, 1077]
}
index = [0, 1, 2, "Total"]
marg_T = pd.DataFrame(data, index = index)
marg_T.index.name = "T"
marg_T

          n
T
0       176
1       441
2       460
Total  1077

### B)

In [79]:
media_A = (marg_A["n"][:3]*marg_A.index[:3]).sum() / marg_A["n"][:3].sum()
media_A

0.8105849582172702

In [80]:
media_T = (marg_T["n"][:3]*marg_T.index[:3]).sum() / marg_T["n"][:3].sum()
media_T

1.2636954503249769